# winget package list
# lines start with "#" and "//" are ignored



##### Work #####

# Communication
SlackTechnologies.Slack
Discord.Discord.Canary
Discord.Discord
LINE.LINE
Cisco.WebexTeams

# Painting Tools
KDE.Krita
JGraph.Draw

# Capture Tools
NickeManarin.ScreenToGif

# Office Tools
TheDocumentFoundation.LibreOffice

# PDF viewer
SumatraPDF.SumatraPDF

# Browser
Google.Chrome
Brave.Brave
PushPlayLabs.Sidekick
PortSwigger.BurpSuite.Community
VivaldiTechnologies.Vivaldi

# File Manager
voidtools.Everything
DigitalScholar.Zotero

# Others
Logitech.OptionsPlus
Nvidia.GeForceExperience
valinet.ExplorerPatcher
Microsoft.PowerToys
Gyan.FFmpeg
Mp3tag.Mp3tag
Highresolution.X-MouseButtonControl
Mega.MEGASync


##### Game #####

# Game Utils
Nvidia.GeForceNow
Valve.Steam



##### Development/Tools #####

# Local Client Tools
WinSCP.WinSCP
PuTTY.PuTTY

# IDE/Emulator
BlueStack.BlueStacks
Oracle.VirtualBox
ArduinoSA.IDE.stable
VaclavSlavik.Poedit
Google.AndroidStudio
JRSoftware.InnoSetup

# Debug/Visualization Tools
PortSwigger.BurpSuite.Community
WiresharkFoundation.Wireshark
DaiyuuNobori.Win10Pcap
AntibodySoftware.WizTree
CrystalDewWorld.CrystalDiskInfo
marha.VcXsrv

# WindowsADK
Microsoft.WindowsADK
Microsoft.ADKPEAddon
Microsoft.WindowsWDK

# Hardware
KiCad.KiCad


##### Development/Environment #####

# Command Utils
Git.Git

# Java
Oracle.JavaRuntimeEnvironment
AdoptOpenJDK.OpenJDK.17

# JavaScript
OpenJS.NodeJS

# Ruby
RubyInstallerTeam.RubyWithDevKit.3.0
RubyInstallerTeam.RubyWithDevKit.3.1
RubyInstallerTeam.RubyWithDevKit.3.2

# .NET
Microsoft.DotNet.SDK.7
Microsoft.DotNet.SDK.6
Microsoft.DotNet.SDK.5

# Other Libraries
Chromium.ChromeDriver
WinFsp.WinFsp
